// Змінна -- це контейнер, який зберігає значення. Завдяки змінним ми можемо
// ми можемо використовувавти дані, змінювати їх і виконувати обчислення в коді.

// var -- старий спосіб
// let -- сучасний і рекомендований спосіб
// const -- для змінних які не можна змінювати

// let -- блочна область видимості
    // використовуєтьс для змінних значення яких можне змінюватись
    // має блочну область видимості, видимі тільки в { ... } де була оголошення
    // не можна повторно оголосити ту саму змінну в одному блоці
    
let name = 'John';
console.log(name); // John

name = 'Doe';
console.log(name); // Doe

// const (константа)
    // Використовується для змінних, які не змінюються.
    // Також має блочну область видимості.
    // Значення об’єкта чи масиву, оголошеного через const, можна змінювати, 
    // але саму змінну не можна переназначити.

const pi = 3.14;
console.log(pi); // 3.14

// pi = 3.15; // Помилка!

const person = { name: 'Alice', age: 25 };
person.age = 26; // Це працює, бо змінюється властивість об’єкта.
console.log(person.age); // 26


// var (глобальна або функціональна область видимості)
    // Старий спосіб оголошення змінних (краще уникати).
    // Має функціональну область видимості (видима в межах функції, 
    // навіть за межами { ... }).
    // Дозволяє повторне оголошення змінної.
    // піднімаються вгору області видимості, але не ініціалізуються. (Hoisting)
    
var message = 'Hello';
console.log(message); // Hello

message = 'Hi';
console.log(message); // Hi

if (true) {
  var greeting = 'Hey';
}
console.log(greeting); // Hey (видима за межами блоку)
